Revit 2027 API
ParameterTypeId.FamilyWorkPlaneBased Property
 "Work Plane-Based"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId FamilyWorkPlaneBased { get; }
Public Shared ReadOnly Property FamilyWorkPlaneBased As ForgeTypeId
	Get
public:
static property ForgeTypeId^ FamilyWorkPlaneBased {
	ForgeTypeId^ get ();
}
static member FamilyWorkPlaneBased : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace